In [2]:
##############
#K. David Roell CFPB 
#collects row-level and counts of data that fail distribution style quality edts
#requires precomputed bins loaded as bin_df from ../linked_dist_stats/IQR_all.csv
#this file is generated using the IQR cleaning viz script which uses data from the get_linked_dist script
##############
from collections import OrderedDict
import json
import os
import pandas as pd
import psycopg2
import matplotlib
import matplotlib.pyplot as plt
import matplotlib.patches as mpatches
import numpy as np
from math import sqrt
get_ipython().magic(u'matplotlib inline')
matplotlib.style.use('ggplot')

with open('../quality_sql.json') as f: #FIXME change to quality_sql.json and refactor the rest of code
    edit_sql = json.load(f)
    
#parameter format for local use #consider changing hmdamaster to roellk if db changes cause a fail
params = {
'dbname':'hmdamaster',
'user':'roellk',
'password':'',
'host':'localhost',
}

try:
    conn = psycopg2.connect(**params)
    cur = conn.cursor()
    print("i'm connected")

except psycopg2.Error as e: #if database connection results in an error print the following
    print("I am unable to connect to the database: ", e)
    
#read csv of distributions
bin_df = pd.read_csv('../linked_dist_stats/IQR_all.csv')
bin_df.drop('Unnamed: 0', inplace=True, axis=1)
bin_df.tail()

i'm connected

,name,std,mean,median,max_mult,med_mult,min_mult,q98,q02,q75,q25,iqr,min_q,max_q,count of loans,pct of total loans
328,9830 to 9860,764.961157,1049.714286,1000.0,0.224343,0.101709,0.015218,2160.80,165.00,1525.00,469.0,1056.00,-1115.000,3109.000,8,0.000347
329,9860 to 9890,381.837662,1620.000000,1620.0,0.191567,0.164138,0.136709,1879.20,1360.80,1755.00,1485.0,270.00,1080.000,2160.000,2,0.000087
330,9890 to 9920,1028.012484,1686.000000,1313.0,0.303153,0.132680,0.032255,2985.60,386.32,2550.00,1035.0,1515.00,-1237.500,4822.500,9,0.000390
331,9920 to 9950,1201.301066,2054.250000,2292.5,0.324264,0.230615,0.041692,3180.02,509.16,2743.25,1603.5,1139.75,-106.125,4452.875,4,0.000173
332,9950 to 9980,1205.352749,1520.666667,1000.0,0.376015,0.100432,0.025100,3599.76,262.00,2000.00,550.0,1450.00,-1625.000,4175.000,11,0.000477

In [3]:
#get counts based on new distribution method
def get_count_edit_fails(table=None, inc_max=None, inc_min=None, amt_min=None, amt_max=None, name=None, prop_type="'1', '2', '3'", loan_purp="'1','2','3'", loan_type="'1','2','3','4'", occupancy="'1','2','3'", lien="'1','2','3'"):
    """generates a SQL statement to get counts of loans outside of expected distributions"""
    
    #set base selection and table
    base_SQL = """SELECT '{name}' AS bin, COUNT(amount) FROM {table} """.format(table=table, name=name)
    
    #set conditions for edit failure
    where_SQL = """WHERE (amount::INT NOT BETWEEN {amt_min} AND {amt_max}) AND
    (income::INT BETWEEN {inc_min} AND {inc_max}) """.format(amt_min=amt_min, amt_max=amt_max, inc_min=inc_min, inc_max=inc_max)
    
    filter_SQL = """AND property_type IN ({prop_type}) AND loan_type IN ({loan_type}) AND 
    loan_purpose IN ({loan_purp}) AND occupancy IN ({occupancy}) AND lien IN ({lien}) 
    """.format(prop_type=prop_type, loan_type=loan_type, loan_purp=loan_purp, occupancy=occupancy, lien=lien)
    #remove NA values from numeric fields
    na_SQL = """AND amount NOT ILIKE '%NA%' AND income NOT ILIKE '%NA%' ;"""

    final_SQL = base_SQL + where_SQL + filter_SQL + na_SQL #combine SQL strings to form query

    return final_SQL
    #sum failed rows

In [4]:
#get rows of failed edits with bin label
def get_row_edit_fails(table=None, inc_max=None, inc_min=None, amt_min=None, amt_max=None, name=None, prop_type="'1', '2', '3'", loan_purp="'1','2','3'", loan_type="'1','2','3','4'", occupancy="'1','2','3'", lien="'1','2','3'"):
    """generates a SQL statement to get rows of loans outside of expected distributions"""
    
    #set base selection and table
    base_SQL = """SELECT '{name}' AS bin, agency, RID, income, amount, sequence FROM {table} """.format(table=table,  name=name)
    
    #set conditions for edit failure
    where_SQL = """WHERE (amount::INT NOT BETWEEN {amt_min} AND {amt_max}) AND
    (income::INT BETWEEN {inc_min} AND {inc_max}) """.format(amt_min=amt_min, amt_max=amt_max, inc_min=inc_min, inc_max=inc_max)
    
    filter_SQL = """AND property_type IN ({prop_type}) AND loan_type IN ({loan_type}) AND 
    loan_purpose IN ({loan_purp}) AND occupancy IN ({occupancy}) AND lien IN ({lien}) 
    """.format(prop_type=prop_type, loan_type=loan_type, loan_purp=loan_purp, occupancy=occupancy, lien=lien)
    #remove NA values from numeric fields
    na_SQL = """AND amount NOT ILIKE '%NA%' AND income NOT ILIKE '%NA%' ;"""

    final_SQL = base_SQL + where_SQL + filter_SQL + na_SQL #combine SQL strings to form query

    return final_SQL
    #sum failed rows

In [ ]:
#get edit fails based on distribution method
#this cell retrieves counts of edit fails by year (year must be adjusted manually)
#FIXME: add second query to get individual records that failed

#kwargs are used to set filters for market product
#this script should be tested with all loan types and property types
kwargs= {'table':'hmdalar2014',
         'prop_type':"'1'",
        'loan_purp':"'1'",
        'loan_type':"'1'",
        'occupancy':"'1'", 
        'lien':"'1'"}


first = True #set boolean flag to instantiate first instance of dataframe

for index, row in bin_df.iterrows(): #iterate over bins of income from bin_df 
#    print(index)
    #set variable arguments for sql query filters
    kwargs['name'] = bin_df.name.loc[index]
    kwargs['inc_min'] = int(kwargs['name'].rsplit(' ', 2)[0])
    kwargs['inc_max'] = int(kwargs['name'].rsplit(' ', 2)[2])
    kwargs['amt_min'] = bin_df.q02.loc[index]
    kwargs['amt_max'] = bin_df.q98.loc[index]
    
    sql = get_count_edit_fails(**kwargs) #format query using kwargs dictionary
    print(sql) #check query text
    cur.execute(sql,) #execute SQL
    data_df = pd.DataFrame(cur.fetchall()) #convert results to dataframe
    
    col_names = [desc[0] for desc in cur.description] # get column names from SQL table    
    if len(data_df.columns) == len(col_names) and first: #name dataframe columns if query not empty

        print('setting column names')
        data_df.columns = col_names

    if first == True and len(data_df.columns) > 0: #set master data frame
        dist_df = data_df.copy()
        first = False

    elif first == False and len(data_df.columns) > 0:
        print('merging dataframes')
        dist_df=pd.concat([dist_df, data_df]) #concat new data to master dataframe

    else:
        print('no data returned from query')

    path = '../linked_dist_stats/' #establish data file path
    if not os.path.exists(path):
        os.makedirs(path)
        
    print(dist_df.tail()) #check dataframe contens

#    dist_df['name'] = bin_df.name.loc[index] #set bin ranges as name
    dist_df.to_csv(path + 'distribution_edit_fails.csv') #save dataframe to file

SELECT '0 to 20' AS bin, COUNT(amount) FROM hmdalar2014 WHERE (amount::INT NOT BETWEEN 7.0 AND 349.0) AND
    (income::INT BETWEEN 0 AND 20) AND property_type IN ('1') AND loan_type IN ('1') AND
    loan_purpose IN ('1') AND occupancy IN ('1') AND lien IN ('1')
    AND amount NOT ILIKE '%NA%' AND income NOT ILIKE '%NA%' ;
setting column names
       bin  count
0  0 to 20    661
SELECT '20 to 50' AS bin, COUNT(amount) FROM hmdalar2014 WHERE (amount::INT NOT BETWEEN 8.0 AND 450.8199999999924) AND
    (income::INT BETWEEN 20 AND 50) AND property_type IN ('1') AND loan_type IN ('1') AND
    loan_purpose IN ('1') AND occupancy IN ('1') AND lien IN ('1')
    AND amount NOT ILIKE '%NA%' AND income NOT ILIKE '%NA%' ;
merging dataframes
       bin  count         0       1
0  0 to 20  661.0       NaN     NaN
0      NaN    NaN  20 to 50  1180.0
SELECT '50 to 80' AS bin, COUNT(amount) FROM hmdalar2014 WHERE (amount::INT NOT BETWEEN 14.0 AND 570.0) AND
    (income::INT BETWEEN 50 AND 80) AND property_type IN ('1') AND loan_type IN ('1') AND
    loan_purpose IN ('1') AND occupancy IN ('1') AND lien IN ('1')
    AND amount NOT ILIKE '%NA%' AND income NOT ILIKE '%NA%' ;

In [ ]:
#get rows of edit fails
#get edit fails based on distribution method
#this cell retrieves counts of edit fails by year (year must be adjusted manually)
#FIXME: add second query to get individual records that failed

#kwargs are used to set filters for market product
#this script should be tested with all loan types and property types
kwargs= {'table':'hmdalar2014',
         'prop_type':"'1'",
        'loan_purp':"'1'",
        'loan_type':"'1'",
        'occupancy':"'1'", 
        'lien':"'1'"}


first = True #set boolean flag to instantiate first instance of dataframe

for index, row in bin_df.iterrows(): #iterate over bins of income from bin_df 
#    print(index)
    #set variable arguments for sql query filters
    kwargs['name'] = bin_df.name.loc[index]
    kwargs['inc_min'] = int(kwargs['name'].rsplit(' ', 2)[0])
    kwargs['inc_max'] = int(kwargs['name'].rsplit(' ', 2)[2])
    kwargs['amt_min'] = bin_df.q02.loc[index]
    kwargs['amt_max'] = bin_df.q98.loc[index]
    
    sql = get_row_edit_fails(**kwargs) #format query using kwargs dictionary
    print(sql) #check query text
    cur.execute(sql,) #execute SQL
    data_df = pd.DataFrame(cur.fetchall()) #convert results to dataframe
    
    col_names = [desc[0] for desc in cur.description] # get column names from SQL table
    
    if len(data_df.columns) == len(col_names): #name dataframe columns if query not empty
        print('setting column names')
        data_df.columns = col_names

    if first == True and len(data_df.columns) > 0: #set master data frame
        dist_df = data_df.copy()
        first = False

    elif first == False and len(data_df.columns) > 0:
        print('merging dataframes')
        dist_df=pd.concat([dist_df, data_df]) #concat new data to master dataframe

    else:
        print('no data returned from query')

    path = '../linked_dist_stats/' #establish data file path
    if not os.path.exists(path):
        os.makedirs(path)
        
    print(dist_df.tail()) #check dataframe contens

    dist_df['name'] = bin_df.name.loc[index] #set bin ranges as name
    dist_df.to_csv(path + 'distribution_row_edit_fails.csv') #save dataframe to file

SELECT '0 to 20' AS bin, agency, RID, income, amount, sequence FROM hmdalar2014 WHERE (amount::INT NOT BETWEEN 349.0 AND 7.0) AND
    (income::INT BETWEEN 0 AND 20) AND property_type IN ('1') AND loan_type IN ('1') AND
    loan_purpose IN ('1') AND occupancy IN ('1') AND lien IN ('1')
    AND amount NOT ILIKE '%NA%' AND income NOT ILIKE '%NA%' ;
setting column names
           bin agency         rid income amount sequence
33359  0 to 20      1  0000014740   0020  00036  0000625
33360  0 to 20      3  0000001821   0020  00014  0000040
33361  0 to 20      3  0000001821   0018  00024  0000049
33362  0 to 20      9  0000451965   0015  00020  0331686
33363  0 to 20      9  0000451965   0015  00030  0585171
SELECT '20 to 50' AS bin, agency, RID, income, amount, sequence FROM hmdalar2014 WHERE (amount::INT NOT BETWEEN 450.8199999999924 AND 8.0) AND
    (income::INT BETWEEN 20 AND 50) AND property_type IN ('1') AND loan_type IN ('1') AND
    loan_purpose IN ('1') AND occupancy IN ('1') AND lien IN ('1')
    AND amount NOT ILIKE '%NA%' AND income NOT ILIKE '%NA%' ;
setting column names
merging dataframes
       agency amount       bin income name         rid sequence
487154      9  00026  20 to 50   0044  NaN  0000451965  0280389
487155      1  00022  20 to 50   0050  NaN  0000718109  0000129
487156      9  00009  20 to 50   0028  NaN  0000451965  0420742
487157      9  00059  20 to 50   0031  NaN  0000451965  0220265
487158      9  00070  20 to 50   0041  NaN  0000501105  0009353
SELECT '50 to 80' AS bin, agency, RID, income, amount, sequence FROM hmdalar2014 WHERE (amount::INT NOT BETWEEN 570.0 AND 14.0) AND
    (income::INT BETWEEN 50 AND 80) AND property_type IN ('1') AND loan_type IN ('1') AND
    loan_purpose IN ('1') AND occupancy IN ('1') AND lien IN ('1')
    AND amount NOT ILIKE '%NA%' AND income NOT ILIKE '%NA%' ;
setting column names
merging dataframes
       agency amount       bin income name         rid sequence
620826      3  00138  50 to 80   0066  NaN  0000014361  0000210
620827      3  00110  50 to 80   0054  NaN  0000014361  0000212
620828      3  00090  50 to 80   0075  NaN  0000020226  0000015
620829      3  00115  50 to 80   0070  NaN  0000020226  0000035
620830      3  00081  50 to 80   0057  NaN  0000020226  0000037
SELECT '80 to 110' AS bin, agency, RID, income, amount, sequence FROM hmdalar2014 WHERE (amount::INT NOT BETWEEN 662.0 AND 24.0) AND
    (income::INT BETWEEN 80 AND 110) AND property_type IN ('1') AND loan_type IN ('1') AND
    loan_purpose IN ('1') AND occupancy IN ('1') AND lien IN ('1')
    AND amount NOT ILIKE '%NA%' AND income NOT ILIKE '%NA%' ;
setting column names
merging dataframes
       agency amount        bin income name         rid sequence
486017      1  00112  80 to 110   0097  NaN  0000014740  0000652
486018      1  00033  80 to 110   0086  NaN  0000014740  0000678
486019      1  00088  80 to 110   0091  NaN  0000014740  0001015
486020      7  00272  80 to 110   0093  NaN  56-2148606  0000478
486021      9  00175  80 to 110   0100  NaN  0000379920  0009327
SELECT '110 to 140' AS bin, agency, RID, income, amount, sequence FROM hmdalar2014 WHERE (amount::INT NOT BETWEEN 753.0 AND 35.0) AND
    (income::INT BETWEEN 110 AND 140) AND property_type IN ('1') AND loan_type IN ('1') AND
    loan_purpose IN ('1') AND occupancy IN ('1') AND lien IN ('1')
    AND amount NOT ILIKE '%NA%' AND income NOT ILIKE '%NA%' ;
setting column names
merging dataframes
       agency amount         bin income name         rid sequence
321025      1  00090  110 to 140   0134  NaN  0000014740  0000573
321026      1  00176  110 to 140   0139  NaN  0000014740  0000889
321027      1  00236  110 to 140   0132  NaN  0000014740  0000951
321028      3  00032  110 to 140   0121  NaN  0000014361  0000023
321029      3  00330  110 to 140   0125  NaN  0000020226  0000029
SELECT '140 to 170' AS bin, agency, RID, income, amount, sequence FROM hmdalar2014 WHERE (amount::INT NOT BETWEEN 860.0 AND 50.0) AND
    (income::INT BETWEEN 140 AND 170) AND property_type IN ('1') AND loan_type IN ('1') AND
    loan_purpose IN ('1') AND occupancy IN ('1') AND lien IN ('1')
    AND amount NOT ILIKE '%NA%' AND income NOT ILIKE '%NA%' ;
setting column names
merging dataframes
       agency amount         bin income name         rid sequence
191854      1  00244  140 to 170   0140  NaN  0000017828  0000136
191855      7  00395  140 to 170   0149  NaN  20-8006279  0000066
191856      7  00288  140 to 170   0150  NaN  20-3388468  0000392
191857      1  00067  140 to 170   0153  NaN  0000014740  0000982
191858      3  00200  140 to 170   0151  NaN  0000015977  0000080
SELECT '170 to 200' AS bin, agency, RID, income, amount, sequence FROM hmdalar2014 WHERE (amount::INT NOT BETWEEN 948.0 AND 63.0) AND
    (income::INT BETWEEN 170 AND 200) AND property_type IN ('1') AND loan_type IN ('1') AND
    loan_purpose IN ('1') AND occupancy IN ('1') AND lien IN ('1')
    AND amount NOT ILIKE '%NA%' AND income NOT ILIKE '%NA%' ;
setting column names
merging dataframes
       agency amount         bin income name         rid sequence
120833      7  00400  170 to 200   0186  NaN  06-0800610  0000208
120834      9  00622  170 to 200   0177  NaN  0000656377  0000099
120835      9  00345  170 to 200   0179  NaN  0000656377  0006979
120836      7  00384  170 to 200   0190  NaN  33-0865281  0047544
120837      7  01035  170 to 200   0182  NaN  7280100005  0001308
SELECT '200 to 230' AS bin, agency, RID, income, amount, sequence FROM hmdalar2014 WHERE (amount::INT NOT BETWEEN 1000.0 AND 75.0) AND
    (income::INT BETWEEN 200 AND 230) AND property_type IN ('1') AND loan_type IN ('1') AND
    loan_purpose IN ('1') AND occupancy IN ('1') AND lien IN ('1')
    AND amount NOT ILIKE '%NA%' AND income NOT ILIKE '%NA%' ;
setting column names
merging dataframes
      agency amount         bin income name         rid sequence
78629      9  00600  200 to 230   0213  NaN  0000656377  0002272
78630      9  00473  200 to 230   0211  NaN  0000656377  0002277
78631      1  00400  200 to 230   0212  NaN  0000014740  0000987
78632      3  00400  200 to 230   0221  NaN  0000020226  0000020
78633      3  00347  200 to 230   0214  NaN  0000020226  0000034
SELECT '230 to 260' AS bin, agency, RID, income, amount, sequence FROM hmdalar2014 WHERE (amount::INT NOT BETWEEN 1106.2399999999907 AND 84.0) AND
    (income::INT BETWEEN 230 AND 260) AND property_type IN ('1') AND loan_type IN ('1') AND
    loan_purpose IN ('1') AND occupancy IN ('1') AND lien IN ('1')
    AND amount NOT ILIKE '%NA%' AND income NOT ILIKE '%NA%' ;
setting column names
merging dataframes
      agency amount         bin income name         rid sequence
52672      9  00400  230 to 260   0241  NaN  0000656377  0002555
52673      3  00417  230 to 260   0259  NaN  0000001513  0000117
52674      2  00550  230 to 260   0249  NaN  0000896856  0000024
52675      5  00105  230 to 260   0238  NaN  0000024567  0000151
52676      7  00160  230 to 260   0254  NaN  32-0016270  0000534
SELECT '260 to 290' AS bin, agency, RID, income, amount, sequence FROM hmdalar2014 WHERE (amount::INT NOT BETWEEN 1200.0 AND 94.0) AND
    (income::INT BETWEEN 260 AND 290) AND property_type IN ('1') AND loan_type IN ('1') AND
    loan_purpose IN ('1') AND occupancy IN ('1') AND lien IN ('1')
    AND amount NOT ILIKE '%NA%' AND income NOT ILIKE '%NA%' ;
setting column names
merging dataframes
      agency amount         bin income name         rid sequence
34469      9  00990  260 to 290   0282  NaN  0000656377  0005700
34470      9  00700  260 to 290   0261  NaN  0000656377  0003610
34471      3  00301  260 to 290   0280  NaN  0000057973  0000239
34472      5  00311  260 to 290   0277  NaN  0000066752  0000828
34473      3  00162  260 to 290   0272  NaN  0000020226  0000018
SELECT '290 to 320' AS bin, agency, RID, income, amount, sequence FROM hmdalar2014 WHERE (amount::INT NOT BETWEEN 1320.0 AND 97.0) AND
    (income::INT BETWEEN 290 AND 320) AND property_type IN ('1') AND loan_type IN ('1') AND
    loan_purpose IN ('1') AND occupancy IN ('1') AND lien IN ('1')
    AND amount NOT ILIKE '%NA%' AND income NOT ILIKE '%NA%' ;
setting column names
merging dataframes
      agency amount         bin income name         rid sequence
25396      3  02015  290 to 320   0294  NaN  27-0684906  0004367
25397      1  00001  290 to 320   0290  NaN  0000013790  0000790
25398      7  00001  290 to 320   0320  NaN  85-5026089  0002654
25399      3  00360  290 to 320   0311  NaN  0000011569  0000231
25400      3  00417  290 to 320   0300  NaN  0000020226  0000026
SELECT '320 to 350' AS bin, agency, RID, income, amount, sequence FROM hmdalar2014 WHERE (amount::INT NOT BETWEEN 1425.0 AND 101.0) AND
    (income::INT BETWEEN 320 AND 350) AND property_type IN ('1') AND loan_type IN ('1') AND
    loan_purpose IN ('1') AND occupancy IN ('1') AND lien IN ('1')
    AND amount NOT ILIKE '%NA%' AND income NOT ILIKE '%NA%' ;
setting column names
merging dataframes
      agency amount         bin income name         rid sequence
18369      9  01850  320 to 350   0350  NaN  0000934329  0000454
18370      5  00001  320 to 350   0336  NaN  0000068626  0000058
18371      7  00001  320 to 350   0320  NaN  85-5026089  0002654
18372      9  01362  320 to 350   0335  NaN  0000656377  0006178
18373      1  00555  320 to 350   0331  NaN  0000010844  0000036
SELECT '350 to 380' AS bin, agency, RID, income, amount, sequence FROM hmdalar2014 WHERE (amount::INT NOT BETWEEN 1496.0 AND 100.0) AND
    (income::INT BETWEEN 350 AND 380) AND property_type IN ('1') AND loan_type IN ('1') AND
    loan_purpose IN ('1') AND occupancy IN ('1') AND lien IN ('1')
    AND amount NOT ILIKE '%NA%' AND income NOT ILIKE '%NA%' ;
setting column names
merging dataframes
      agency amount         bin income name         rid sequence
14171      9  01058  350 to 380   0371  NaN  0000510871  0004304
14172      2  00305  350 to 380   0378  NaN  0000063573  0000088
14173      2  00700  350 to 380   0360  NaN  0000625654  0000108
14174      3  00265  350 to 380   0361  NaN  0000057973  0000098
14175      3  00417  350 to 380   0375  NaN  0000020226  0000041
SELECT '380 to 410' AS bin, agency, RID, income, amount, sequence FROM hmdalar2014 WHERE (amount::INT NOT BETWEEN 1580.0 AND 102.0) AND
    (income::INT BETWEEN 380 AND 410) AND property_type IN ('1') AND loan_type IN ('1') AND
    loan_purpose IN ('1') AND occupancy IN ('1') AND lien IN ('1')
    AND amount NOT ILIKE '%NA%' AND income NOT ILIKE '%NA%' ;
setting column names
merging dataframes
      agency amount         bin income name         rid sequence
10574      1  02100  380 to 410   0392  NaN  0000707960  0000146
10575      1  02100  380 to 410   0409  NaN  0000013684  0002037
10576      9  02000  380 to 410   0383  NaN  0000480228  0151668
10577      7  02000  380 to 410   0381  NaN  37-1542226  0017404
10578      3  00230  380 to 410   0398  NaN  0000020226  0000014
SELECT '410 to 440' AS bin, agency, RID, income, amount, sequence FROM hmdalar2014 WHERE (amount::INT NOT BETWEEN 1700.0 AND 102.0) AND
    (income::INT BETWEEN 410 AND 440) AND property_type IN ('1') AND loan_type IN ('1') AND
    loan_purpose IN ('1') AND occupancy IN ('1') AND lien IN ('1')
    AND amount NOT ILIKE '%NA%' AND income NOT ILIKE '%NA%' ;
setting column names
merging dataframes
     agency amount         bin income name         rid sequence
7785      9  02170  410 to 440   0412  NaN  0000480228  0242155
7786      2  00001  410 to 440   0424  NaN  0000403151  0000206
7787      1  00327  410 to 440   0432  NaN  0000024719  0000070
7788      1  00442  410 to 440   0437  NaN  0000014740  0000846
7789      3  00340  410 to 440   0425  NaN  0000020226  0000030
SELECT '440 to 470' AS bin, agency, RID, income, amount, sequence FROM hmdalar2014 WHERE (amount::INT NOT BETWEEN 1732.0 AND 101.0) AND
    (income::INT BETWEEN 440 AND 470) AND property_type IN ('1') AND loan_type IN ('1') AND
    loan_purpose IN ('1') AND occupancy IN ('1') AND lien IN ('1')
    AND amount NOT ILIKE '%NA%' AND income NOT ILIKE '%NA%' ;
setting column names
merging dataframes
     agency amount         bin income name         rid sequence
6512      7  00001  440 to 470   0467  NaN  33-0865281  0013300
6513      2  00300  440 to 470   0448  NaN  0000671147  0000206
6514      9  01950  440 to 470   0461  NaN  0000656377  0003985
6515      7  00246  440 to 470   0464  NaN  20-8006279  0000027
6516      3  00975  440 to 470   0457  NaN  0000058371  0000010
SELECT '470 to 500' AS bin, agency, RID, income, amount, sequence FROM hmdalar2014 WHERE (amount::INT NOT BETWEEN 1910.0 AND 100.0) AND
    (income::INT BETWEEN 470 AND 500) AND property_type IN ('1') AND loan_type IN ('1') AND
    loan_purpose IN ('1') AND occupancy IN ('1') AND lien IN ('1')
    AND amount NOT ILIKE '%NA%' AND income NOT ILIKE '%NA%' ;
setting column names
merging dataframes
     agency amount         bin income name         rid sequence
5722      9  03342  470 to 500   0494  NaN  0000504713  0189185
5723      2  02500  470 to 500   0481  NaN  0000154257  0000103
5724      3  02657  470 to 500   0483  NaN  0000058556  0000065
5725      9  02400  470 to 500   0471  NaN  0000817824  0070813
5726      9  00325  470 to 500   0475  NaN  0000656377  0006128
SELECT '500 to 530' AS bin, agency, RID, income, amount, sequence FROM hmdalar2014 WHERE (amount::INT NOT BETWEEN 1980.0 AND 107.0) AND
    (income::INT BETWEEN 500 AND 530) AND property_type IN ('1') AND loan_type IN ('1') AND
    loan_purpose IN ('1') AND occupancy IN ('1') AND lien IN ('1')
    AND amount NOT ILIKE '%NA%' AND income NOT ILIKE '%NA%' ;
setting column names
merging dataframes
     agency amount         bin income name         rid sequence
4667      3  00417  500 to 530   0505  NaN  0000027286  0000419
4668      3  00988  500 to 530   0506  NaN  0000058040  0000003
4669      2  00683  500 to 530   0512  NaN  0000339773  0000080
4670      1  02696  500 to 530   0509  NaN  0000023880  0002233
4671      3  00300  500 to 530   0502  NaN  0000020226  0000044
SELECT '530 to 560' AS bin, agency, RID, income, amount, sequence FROM hmdalar2014 WHERE (amount::INT NOT BETWEEN 2030.9399999999987 AND 104.0) AND
    (income::INT BETWEEN 530 AND 560) AND property_type IN ('1') AND loan_type IN ('1') AND
    loan_purpose IN ('1') AND occupancy IN ('1') AND lien IN ('1')
    AND amount NOT ILIKE '%NA%' AND income NOT ILIKE '%NA%' ;
setting column names
merging dataframes
     agency amount         bin income name         rid sequence
3648      9  02800  530 to 560   0550  NaN  0004114567  0005841
3649      9  02750  530 to 560   0540  NaN  0004114567  0005426
3650      9  02850  530 to 560   0532  NaN  0000917742  0011718
3651      7  00008  530 to 560   0554  NaN  61-1355156  0004782
3652      9  00850  530 to 560   0552  NaN  0000656377  0000031
SELECT '560 to 590' AS bin, agency, RID, income, amount, sequence FROM hmdalar2014 WHERE (amount::INT NOT BETWEEN 2125.2799999999993 AND 104.0) AND
    (income::INT BETWEEN 560 AND 590) AND property_type IN ('1') AND loan_type IN ('1') AND
    loan_purpose IN ('1') AND occupancy IN ('1') AND lien IN ('1')
    AND amount NOT ILIKE '%NA%' AND income NOT ILIKE '%NA%' ;
setting column names
merging dataframes
     agency amount         bin income name         rid sequence
2852      9  03000  560 to 590   0561  NaN  0000212465  0001200
2853      9  03000  560 to 590   0570  NaN  0000451965  0153404
2854      7  02975  560 to 590   0561  NaN  56-2471041  0004309
2855      9  02895  560 to 590   0564  NaN  0000804963  0008320
2856      9  03200  560 to 590   0580  NaN  0000852218  0338858
SELECT '590 to 620' AS bin, agency, RID, income, amount, sequence FROM hmdalar2014 WHERE (amount::INT NOT BETWEEN 2242.8799999999974 AND 100.0) AND
    (income::INT BETWEEN 590 AND 620) AND property_type IN ('1') AND loan_type IN ('1') AND
    loan_purpose IN ('1') AND occupancy IN ('1') AND lien IN ('1')
    AND amount NOT ILIKE '%NA%' AND income NOT ILIKE '%NA%' ;
setting column names
merging dataframes
     agency amount         bin income name         rid sequence
2758      9  02999  590 to 620   0598  NaN  0003918898  0000241
2759      7  03000  590 to 620   0600  NaN  34-1719615  0002177
2760      9  04000  590 to 620   0603  NaN  0000451965  0467833
2761      9  03000  590 to 620   0591  NaN  0004114567  0008606
2762      3  00005  590 to 620   0600  NaN  0000003657  0001257
SELECT '620 to 650' AS bin, agency, RID, income, amount, sequence FROM hmdalar2014 WHERE (amount::INT NOT BETWEEN 2320.0 AND 102.10000000000002) AND
    (income::INT BETWEEN 620 AND 650) AND property_type IN ('1') AND loan_type IN ('1') AND
    loan_purpose IN ('1') AND occupancy IN ('1') AND lien IN ('1')
    AND amount NOT ILIKE '%NA%' AND income NOT ILIKE '%NA%' ;
setting column names
merging dataframes
     agency amount         bin income name         rid sequence
2183      9  03420  620 to 650   0644  NaN  0000063069  0001074
2184      7  03300  620 to 650   0621  NaN  95-4623407  0013237
2185      9  05320  620 to 650   0640  NaN  0002489805  0002111
2186      1  03400  620 to 650   0640  NaN  0000024976  0000308
2187      9  03650  620 to 650   0636  NaN  20-5728606  0000004
SELECT '650 to 680' AS bin, agency, RID, income, amount, sequence FROM hmdalar2014 WHERE (amount::INT NOT BETWEEN 2406.719999999994 AND 108.0) AND
    (income::INT BETWEEN 650 AND 680) AND property_type IN ('1') AND loan_type IN ('1') AND
    loan_purpose IN ('1') AND occupancy IN ('1') AND lien IN ('1')
    AND amount NOT ILIKE '%NA%' AND income NOT ILIKE '%NA%' ;
setting column names
merging dataframes
     agency amount         bin income name         rid sequence
1876      9  03675  650 to 680   0660  NaN  0000212465  0008657
1877      9  03430  650 to 680   0656  NaN  0000504713  0171171
1878      7  03428  650 to 680   0675  NaN  95-4623407  0027254
1879      9  04800  650 to 680   0660  NaN  0000451965  0465823
1880      7  00810  650 to 680   0659  NaN  61-1355156  0001717
SELECT '680 to 710' AS bin, agency, RID, income, amount, sequence FROM hmdalar2014 WHERE (amount::INT NOT BETWEEN 2414.619999999999 AND 113.0) AND
    (income::INT BETWEEN 680 AND 710) AND property_type IN ('1') AND loan_type IN ('1') AND
    loan_purpose IN ('1') AND occupancy IN ('1') AND lien IN ('1')
    AND amount NOT ILIKE '%NA%' AND income NOT ILIKE '%NA%' ;
setting column names
merging dataframes
     agency amount         bin income name         rid sequence
1631      9  04325  680 to 710   0707  NaN  0002193616  0000468
1632      9  03583  680 to 710   0690  NaN  0002489805  0006765
1633      9  04388  680 to 710   0684  NaN  0004114567  0008652
1634      5  01270  680 to 710   0683  NaN  0000066349  0000249
1635      1  01750  680 to 710   0706  NaN  0000702454  0000931
SELECT '710 to 740' AS bin, agency, RID, income, amount, sequence FROM hmdalar2014 WHERE (amount::INT NOT BETWEEN 2500.0 AND 99.0) AND
    (income::INT BETWEEN 710 AND 740) AND property_type IN ('1') AND loan_type IN ('1') AND
    loan_purpose IN ('1') AND occupancy IN ('1') AND lien IN ('1')
    AND amount NOT ILIKE '%NA%' AND income NOT ILIKE '%NA%' ;
setting column names
merging dataframes
     agency amount         bin income name         rid sequence
1362      9  03770  710 to 740   0711  NaN  0000504713  0165049
1363      9  04200  710 to 740   0724  NaN  0002489805  0010991
1364      9  03600  710 to 740   0720  NaN  0000804963  0003568
1365      9  05180  710 to 740   0737  NaN  0004114567  0003915
1366      9  03965  710 to 740   0719  NaN  0002735146  0047108
SELECT '740 to 770' AS bin, agency, RID, income, amount, sequence FROM hmdalar2014 WHERE (amount::INT NOT BETWEEN 2555.0 AND 109.0) AND
    (income::INT BETWEEN 740 AND 770) AND property_type IN ('1') AND loan_type IN ('1') AND
    loan_purpose IN ('1') AND occupancy IN ('1') AND lien IN ('1')
    AND amount NOT ILIKE '%NA%' AND income NOT ILIKE '%NA%' ;

In [ ]:
#compress tail bins for counts df into one 600+ income
fail_counts_df = pd.read_csv(path + 'distribution_edit_fails.csv')